In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Virat','Umair','Mehak','Tanisha','Vedant','Rupal','Rachit'],
       'Marks':[98,99,97,96,89,92,85],
       'Gender':['Male','Male','Female','Female','Male','Female','Male']
       }
df1 = pd.DataFrame(dict1)

In [3]:
df1

      Name  Marks  Gender
0    Virat     98    Male
1    Umair     99    Male
2    Mehak     97  Female
3  Tanisha     96  Female
4   Vedant     89    Male
5    Rupal     92  Female
6   Rachit     85    Male

In [4]:
df1.head(2)

    Name  Marks Gender
0  Virat     98   Male
1  Umair     99   Male

In [5]:
df1.tail(5)

      Name  Marks  Gender
2    Mehak     97  Female
3  Tanisha     96  Female
4   Vedant     89    Male
5    Rupal     92  Female
6   Rachit     85    Male

In [6]:
df1.shape

(7, 3)

In [7]:
print('No. of rows:',df1.shape[0])

No. of rows: 7

In [8]:
print('No. of columns:',df1.shape[1])

No. of columns: 3

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [10]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [11]:
df1.describe(include='all')

         Name      Marks Gender
count       7   7.000000      7
unique      7        NaN      2
top     Virat        NaN   Male
freq        1        NaN      4
mean      NaN  93.714286    NaN
std       NaN   5.219013    NaN
min       NaN  85.000000    NaN
25%       NaN  90.500000    NaN
50%       NaN  96.000000    NaN
75%       NaN  97.500000    NaN
max       NaN  99.000000    NaN

In [12]:
df1

      Name  Marks  Gender
0    Virat     98    Male
1    Umair     99    Male
2    Mehak     97  Female
3  Tanisha     96  Female
4   Vedant     89    Male
5    Rupal     92  Female
6   Rachit     85    Male

In [13]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [14]:
df1['Gender'].nunique()

2

In [15]:
df1['Gender'].value_counts()

Male      4
Female    3
Name: Gender, dtype: int64

In [20]:
df1[df1['Marks']>=98]

    Name  Marks Gender
0  Virat     98   Male
1  Umair     99   Male

In [22]:
df1[(df1['Marks']>=90) & (df1['Marks']<=95)]

    Name  Marks  Gender
5  Rupal     92  Female

In [27]:
len([(df1['Marks']>=90) & (df1['Marks']<=95)])

1

In [30]:
df1[df1['Marks'].between(80,95)]

     Name  Marks  Gender
4  Vedant     89    Male
5   Rupal     92  Female
6  Rachit     85    Male

In [32]:
df1['Marks'].mean()

93.71428571428571

In [33]:
df1['Marks'].min()

85

In [38]:
def marks(x):
    return x//2

In [39]:
df1['Marks'].apply(marks)

0    49
1    49
2    48
3    48
4    44
5    46
6    42
Name: Marks, dtype: int64

In [40]:
df1['Half'] = df1['Marks'].apply(marks)

In [41]:
df1

      Name  Marks  Gender  Half
0    Virat     98    Male    49
1    Umair     99    Male    49
2    Mehak     97  Female    48
3  Tanisha     96  Female    48
4   Vedant     89    Male    44
5    Rupal     92  Female    46
6   Rachit     85    Male    42

In [42]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    49.5
2    48.5
3    48.0
4    44.5
5    46.0
6    42.5
Name: Marks, dtype: float64

In [53]:
df1

      Name  Marks  Gender
0    Virat     98    Male
1    Umair     99    Male
2    Mehak     97  Female
3  Tanisha     96  Female
4   Vedant     89    Male
5    Rupal     92  Female
6   Rachit     85    Male

In [44]:
df1['M_F'] = df1['Gender'].map({'Male':1,'Female':0})

In [52]:
df1

      Name  Marks  Gender
0    Virat     98    Male
1    Umair     99    Male
2    Mehak     97  Female
3  Tanisha     96  Female
4   Vedant     89    Male
5    Rupal     92  Female
6   Rachit     85    Male

In [55]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [57]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [58]:
df1

      Name  Marks  Gender
0    Virat     98    Male
1    Umair     99    Male
2    Mehak     97  Female
3  Tanisha     96  Female
4   Vedant     89    Male
5    Rupal     92  Female
6   Rachit     85    Male

In [59]:
df1.sort_values(by='Marks')

      Name  Marks  Gender
6   Rachit     85    Male
4   Vedant     89    Male
5    Rupal     92  Female
3  Tanisha     96  Female
2    Mehak     97  Female
0    Virat     98    Male
1    Umair     99    Male

In [60]:
df1.sort_values(by='Marks',ascending = False)

      Name  Marks  Gender
1    Umair     99    Male
0    Virat     98    Male
2    Mehak     97  Female
3  Tanisha     96  Female
5    Rupal     92  Female
4   Vedant     89    Male
6   Rachit     85    Male

In [62]:
df1.sort_values(by=['Marks','Gender'],ascending = False)

      Name  Marks  Gender
1    Umair     99    Male
0    Virat     98    Male
2    Mehak     97  Female
3  Tanisha     96  Female
5    Rupal     92  Female
4   Vedant     89    Male
6   Rachit     85    Male

In [64]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
2    Mehak     97
3  Tanisha     96
5    Rupal     92

In [65]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
2    Mehak     97
3  Tanisha     96
5    Rupal     92